In [13]:
import numpy as np
import pandas as pd

# Task 0
Read the dataset from csv file & perform data cleaning - remove all rows, which contains `?` in some columns.
Also check for data correctness (salary & salary $K).

In [14]:
df = pd.read_csv("../data/adult.csv")
df.replace(to_replace = "?", value = np.nan, inplace = True)
df.dropna()
df["salary"].unique()
df["salary K$"].unique()

array([ 39,  35,  27,  43,  25,  44,  49, 307, 330, 303, 116, 279,  28,
       325,  15,  42,  31, 151, 265,  36, 117, 275,  21,  16,  37,  18,
        30,  40, 166,  41,  17,  47, 268,  34,  26,  45, 254, 332, 341,
        38,  33,  19,  48, 248,  32, 225, 194, 301,  24,  22, 278, 233,
        86, 284, 217, 120,  99, 323, 197,  23,  46, 250, 274, 244, 346,
       171, 215,  20, 140, 133, 106, 266, 231, 242, 176, 339,  29, 125,
       143,  70,  53, 239,  73, 160, 329, 247, 145, 148, 316, 124, 199,
       296, 112, 177,  85,  83, 331, 286, 180, 214, 169, 256, 185, 115,
       157, 163, 276,  82, 321, 261, 181, 167, 210, 259,  79, 337, 328,
       168,  74, 183, 314, 334,  87, 320, 347,  89,  55,  52, 348, 146,
       251, 174, 234, 338, 227, 113, 282, 191, 269, 344, 184, 141, 158,
        91, 263, 319, 285, 216, 155, 179, 122,  97, 202, 134, 178, 153,
       161, 236, 144, 182, 102,  67, 297, 230, 342,  58, 188, 298, 100,
       108, 260, 118,  95, 240, 300,  59, 313,  98, 223, 271, 150, 295,
       280, 309, 209, 101, 224, 281, 222, 187,  63,  66, 130, 105, 270,
       294, 189, 129, 349, 147, 340, 200, 235,  57, 237, 107, 103, 253,
       293, 198, 119, 206, 175, 207, 127, 232, 111, 186, 110,  90, 126,
       211,  84,  60, 192, 203, 212, 137, 132, 272,  96, 228, 208, 138,
       172, 302, 218, 315, 277, 149, 238, 162, 308, 128, 304, 121,  51,
       336, 326, 241,  61, 262, 324, 317, 196,  69,  75, 159, 310, 264,
       164, 258, 156, 114, 311,  80,  77,  64, 243,  68, 229, 165, 292,
       345, 245, 170, 142, 252, 287, 305,  88, 221, 289,  62, 226, 267,
       204, 273, 152, 327,  92, 190, 343, 290, 154,  71, 219,  81, 288,
       136, 322,  56, 139, 205,  72, 249, 335, 333, 131,  65, 257, 104,
       135, 213, 299, 109, 220, 255, 283, 173,  76, 123,  93, 318, 201,
       246, 306, 195,  94,  78, 193, 312, 291,  54], dtype=int64)

# Task 1
Print the count of men and women in the dataset.

In [15]:
df['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

# Task 2
Find the average age of men in dataset

In [16]:
men_avg_age = df.groupby("sex").get_group("Male").age.mean()

# Task 3
Get the percentage of people from Poland (native-country)

In [17]:
total = df.shape[0]
polish = df["native-country"].where(df["native-country"]=="Poland").count()
percentage = polish * 100 / total

# Task 4
Get the mean and standard deviation of the age for people who earn > 50K per year. After this, get it for those who earn <= 50K.

In [18]:
salary_gt_50K = df.groupby("salary").get_group(">50K").age
salary_gt_50K_mean = salary_gt_50K.mean()
salary_gt_50K_std = salary_gt_50K.std()
salary_lt_50K = df.groupby("salary").get_group("<=50K").age
salary_lt_50K_mean = salary_lt_50K.mean()
salary_lt_50K_std = salary_lt_50K.std()

# Task 5
Check, if there are some people without higher education (education: Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters, Doctorate), but with > 50K salary

In [19]:
df[~df["education"].isin(["Bachelors", "Prof-school", "Assoc-acdm", "Assoc-voc", "Masters", "Doctorate"]) & (df["salary"] == ">50K")]

,Unnamed: 0,age,workclass,education,marital-status,occupation,relationship,race,sex,hours-per-week,native-country,salary,salary K$
7,7,52,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,45,United-States,>50K,307
10,10,37,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,80,United-States,>50K,116
27,27,54,NaN,Some-college,Married-civ-spouse,NaN,Husband,Asian-Pac-Islander,Male,60,South,>50K,275
38,38,31,Private,Some-college,Married-civ-spouse,Sales,Husband,White,Male,38,NaN,>50K,166
55,55,43,Private,Some-college,Married-civ-spouse,Tech-support,Husband,White,Male,40,United-States,>50K,341
...,...,...,...,...,...,...,...,...,...,...,...,...,...
32510,32510,39,Private,HS-grad,Married-civ-spouse,Prof-specialty,Husband,White,Male,45,NaN,>50K,212
32518,32518,57,Local-gov,HS-grad,Married-civ-spouse,Craft-repair,Husband,White,Male,40,United-States,>50K,116
32519,32519,46,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,White,Male,48,United-States,>50K,239
32557,32557,40,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,40,United-States,>50K,173
32560,32560,52,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,40,United-States,>50K,243

# Task 6
Get the statistics of age for each type of education. Use `groupby` and `describe` for this.

In [20]:
df.groupby("education").age.describe()

                count       mean        std   min    25%   50%   75%   max
education
10th            933.0  37.429796  16.720713  17.0  22.00  34.0  52.0  90.0
11th           1175.0  32.355745  15.545485  17.0  18.00  28.0  43.0  90.0
12th            433.0  32.000000  14.334625  17.0  19.00  28.0  41.0  79.0
1st-4th         168.0  46.142857  15.615625  19.0  33.00  46.0  57.0  90.0
5th-6th         333.0  42.885886  15.557285  17.0  29.00  42.0  54.0  84.0
7th-8th         646.0  48.445820  16.092350  17.0  34.25  50.0  61.0  90.0
9th             514.0  41.060311  15.946862  17.0  28.00  39.0  54.0  90.0
Assoc-acdm     1067.0  37.381443  11.095177  19.0  29.00  36.0  44.0  90.0
Assoc-voc      1382.0  38.553546  11.631300  19.0  30.00  37.0  46.0  84.0
Bachelors      5355.0  38.904949  11.912210  19.0  29.00  37.0  46.0  90.0
Doctorate       413.0  47.702179  11.784716  24.0  39.00  47.0  55.0  80.0
HS-grad       10501.0  38.974479  13.541524  17.0  28.00  37.0  48.0  90.0
Masters        1723.0  44.049913  11.068935  18.0  36.00  43.0  51.0  90.0
Preschool        51.0  42.764706  15.126914  19.0  31.00  41.0  53.5  75.0
Prof-school     576.0  44.746528  11.962477  25.0  36.00  43.0  51.0  90.0
Some-college   7291.0  35.756275  13.474051  17.0  24.00  34.0  45.0  90.0

# Task 7
Compare the married and non-married men salaries. Who earns more? (>50K or <=50K)
Married men are those, whom `marital-status` starts with "Married". Others are not.

In [21]:
married = df["salary K$"][(df["sex"]=="Male") & (df["marital-status"].str.startswith("Married"))].mean()
unmarried = df["salary K$"][(df["sex"]=="Male") & (~df["marital-status"].str.startswith("Married"))].mean()
result = f"{('Unmarried', 'Married')[married > unmarried]} men earn more."

C:\Users\vikto\AppData\Local\Temp\ipykernel_16528\2308247821.py:3: DeprecationWarning: In future, it will be an error for 'np.bool_' scalars to be interpreted as an index
  result = f"{('Unmarried', 'Married')[married > unmarried]} men earn more."

# Task 8
Get the max hours per week some person works. How many people works the same amount of hours per week?

In [24]:
df["hours-per-week"].max()
df["hours-per-week"].value_counts()

99

# Task 9
Analyze the correlation between data in dataset. Understand connected fields in it and print highlight their connection.

In [30]:
df.corr()
summary = "Based on the results of the correlation analysis we can highlight a slight direct dependence of the salary of an employee on the working hours and the age."

,Unnamed: 0,age,hours-per-week,salary K$,men,women
Unnamed: 0,1.000000,0.001286,0.000607,-0.001666,-0.002472,0.002472
age,0.001286,1.000000,0.068756,0.201774,0.088832,-0.088832
hours-per-week,0.000607,0.068756,1.000000,0.196916,0.229309,-0.229309
salary K$,-0.001666,0.201774,0.196916,1.000000,0.182528,-0.182528
men,-0.002472,0.088832,0.229309,0.182528,1.000000,-1.000000
women,0.002472,-0.088832,-0.229309,-0.182528,-1.000000,1.000000